app/Repositories/Eloquents/C_HomeRepository.php

	public function login()
	{
			$username=Request::get('username');
			$password=Request::get('password');
			$arr=user::where('user_username','=',$username)
					->first();
			if(!isset($arr) || hash::check($password,$arr->user_password)==false || $arr->user_use!=0)
			{
				return redirect(url('login'));
			}
			user::where('user_username','=',$username)->update(['user_use'=>1]);
---
update `user` set `user_use` = '1' where `user_username` = 'admin'