app/Repositories/Eloquents/C_NewsRepository.php

	public function list_news()
	{
		$data = tbl_news::select('tbl_news.id','news_img','news_title','news_content','user_name')->orderBy('tbl_news.id','desc')->join('user','user.id','=','tbl_news.user_id')->get();
---
select `tbl_news`.`id`, `news_img`, `news_title`, `news_content`, `user_name` from `tbl_news` inner join `user` on `user`.`id` = `tbl_news`.`user_id` order by `tbl_news`.`id` desc