app/Repositories/Eloquents/C_ToeicRepository.php

	public function list_question()
	{
		$data = tbl_question::join('tbl_answer','tbl_question.answer_id','=','tbl_answer.id')->join('tbl_part','tbl_question.part_id','=','tbl_part.id')->get();
---
select * from `tbl_question` inner join `tbl_answer` on `tbl_question`.`answer_id` = `tbl_answer`.`id` inner join `tbl_part` on `tbl_question`.`part_id` = `tbl_part`.`id`