app/Repositories/Eloquents/C_UserRepository.php

	public function do_edit_user($id)
	{
		$ImageService= new ImageService();
		$img= 'user_img';

			$data = user::where('id','=',$id)->select('user_img')->first();
			$password=Request::get('user_password');
			$sex=Request::get('user_sex');
			$birthday=Request::get('user_birthday');
			$address=Request::get('user_address');
			$fullname=empty(Request::get('user_fullname'))?'':Request::get('user_fullname');
			$email=empty(Request::get('user_email'))?'':Request::get('user_email');
			$phone=empty(Request::get('user_phone'))?'':Request::get('user_phone');
			$description=empty(Request::get('user_description'))?'':Request::get('user_description');
			if($password!="")
			{
				$password=hash::make($password);
				user::where('id','=',$id)->update([
					'user_password'=>$password,
					'user_name'=>$fullname,
					'user_sex'=>$sex,
					'user_birthday'=>$birthday,
					'user_address'=>$address,
					'user_email'=>$email,
					'user_phone'=>$phone,
					'user_description'=>$description
				]);
			}
			else
			{
				user::where('id','=',$id)->update([
					'user_name'=>$fullname,
					'user_sex'=>$sex,
					'user_birthday'=>$birthday,
					'user_address'=>$address,
					'user_email'=>$email,
					'user_phone'=>$phone,
					'user_description'=>$description
				]);
---
update `user` set `user_name` = 'Nguyen Van c', `user_sex` = 'man', `user_birthday` = '2018-04-27', `user_address` = 'danang', `user_email` = 'c@gmail.com', `user_phone` = '123456', `user_description` = '' where `id` = '3'

						if($sex == 'man')
						{
							$image_name = 'man.png';
							user::where('id','=',$id)->update(['user_img'=>$image_name]);
---
update `user` set `user_img` = 'man.png' where `id` = '3'